driver-tests/bpelse/assign/AssignJbi/test/copyRepeatingNodesUsingPredicate/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Employee xmlns="http://xml.netbeans.org/examples/EmployeeNS">
      <person xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS">
        <ns3:EmployeeNumber xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">1234</ns3:EmployeeNumber>
        <ns3:LastName xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Doe</ns3:LastName>
        <ns3:JobTitle xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Sr Engineer</ns3:JobTitle>
        <ns3:Department xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Development</ns3:Department>
        <ns3:Supervisor xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Yes</ns3:Supervisor>
      </person>
      <home>
        <name xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">John Doe</name>
        <street xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">123 street</street>
        <city xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Monrovia</city>
        <state xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">CA</state>
        <zip xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">91016</zip>
        <note xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note1</note>
        <note xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note2</note>
        <note xmlns="http://xml.netbeans.org/examples/AddressNS" xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note3</note>
      </home>
    </Employee>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
