driver-tests/bpelse/assign/AssignJbi/test/results/ErroneousExpr/Actual_20130314183826_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Employee xmlns="http://xml.netbeans.org/examples/EmployeeNS" xmlns:msgns="http://j2ee.netbeans.org/wsdl/ErroneousExpr">
      <person xmlns:add="http://xml.netbeans.org/examples/AddressNS" xmlns:emp="http://xml.netbeans.org/examples/EmployeeNS" xmlns:emp1="http://xml.netbeans.org/examples/EmployeeInfoNS" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <emp1:EmployeeNumber>456</emp1:EmployeeNumber>
        <emp1:LastName>Smith</emp1:LastName>
        
        <emp1:FirstName>Code</emp1:FirstName>
        
      </person>
      <home xmlns:add="http://xml.netbeans.org/examples/AddressNS" xmlns:emp="http://xml.netbeans.org/examples/EmployeeNS" xmlns:emp1="http://xml.netbeans.org/examples/EmployeeInfoNS" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" country="US">
        <add:name>home</add:name>
        <add:street>123 Main St.</add:street>
        <add:city>Anywhere</add:city>
        <add:state>CA</add:state>
        <add:zip>91234</add:zip>
        <add:note>my note</add:note>
      </home>
    </Employee>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>