driver-tests/bpelse/assign/AssignJbi/test/ErroneousExpr/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://xml.netbeans.org/examples/EmployeeNS" xmlns:emp1="http://xml.netbeans.org/examples/EmployeeInfoNS" xmlns:add="http://xml.netbeans.org/examples/AddressNS">
  <soapenv:Body>
    <emp:Employee department="?string?">
      <emp:person>
        <emp1:EmployeeNumber>123</emp1:EmployeeNumber>
        <emp1:LastName>Smith</emp1:LastName>
        <!--Optional:-->
        <emp1:FirstName>Bob</emp1:FirstName>
        <!--Optional:
        <emp1:JobTitle>?string?</emp1:JobTitle>
        <emp1:Department>?string?</emp1:Department>
        <emp1:Supervisor>?string?</emp1:Supervisor>
        -->
      </emp:person>
      <emp:home country="US">
        <add:name>home</add:name>
        <add:street>123 Main St.</add:street>
        <add:city>Anywhere</add:city>
        <add:state>CA</add:state>
        <add:zip>91234</add:zip>
        <add:note>my note</add:note>
      </emp:home>
      <!--Optional:
      <emp:work country="US">
        <add:name>?string?</add:name>
        <add:street>?string?</add:street>
        <add:city>?string?</add:city>
        <add:state>?string?</add:state>
        <add:zip>?1000.00?</add:zip>
        <add:note>?string?</add:note>
      </emp:work>
      -->
    </emp:Employee>
  </soapenv:Body>
</soapenv:Envelope>